import './App.css';
import { Simpsons} from "./Components/Simpsons/Simpsons";

const App=()=> {

    return (
        <div className="App">
            <Simpsons itemName={'Bart'}
                      info={'Бартолом\'ю ДжоДжо «Барт» Сімпсон — один із головних героїв мультиплікаційного серіалу Сімпсони.' +
                          ' Барт — найстарша дитина Гомера і Мардж Сімпсон.' +
                          ' У нього також є дві молодші сестри — Ліса і Меґґі. Барт є втіленням образу бешкетника та посереднього учня у школі.'}
                      pic={'https://static.wikia.nocookie.net/deathbattlefanon/images/f/f7/6355543_preview.png'}
            />
            <Simpsons itemName={'Homer'}
                      info={'Гомер Джей Сімпсон — один із головних героїв мультсеріалу «Сімпсони». Гомер — милий та кумедний,' +
                          ' проте іноді грубий і неввічливий батько родини. Він має очевидні вади: товстий, лисий і не дуже розумний.' +
                          ' Нерідко він поводиться як блазень, абсурдно, егоїстично і нетактовно, але все ж лишається симпатичним.'}
                      pic={'https://upload.wikimedia.org/wikipedia/en/0/02/Homer_Simpson_2006.png'}
            />
            <Simpsons itemName={'Lisa'}
                      info={'Лі́са Марі Сімпсон — персонажка анімаційного телесеріалу «Сімпсони», озвучена Ярдлі Сміт.' +
                          ' Автор серіалу Мет Ґрейнінґ назвав героїню іменем сестри.' +
                          ' Ліса — надзвичайно розумна восьмирічна дівчинка, один з найрозумніших у серіалі. Феміністка. Грає на саксофоні.'}
                      pic={'https://upload.wikimedia.org/wikipedia/en/e/ec/Lisa_Simpson.png'}
            />
            <Simpsons itemName={'Marge'}
                      info={'Марджорі Сімпсон — один з головних персонажів анімаційного серіалу Сімпсони, дружина Гомера Сімпсона, мати Ліси та Барта.' +
                          ' Домогосподарка, майже весь свій час проводить удома доглядаючи наймолодшу дитину Меґґі, а також Барта, Лісу і чоловіка.'}
                      pic={'https://upload.wikimedia.org/wikipedia/ru/0/0b/Marge_Simpson.png'}
            />
        </div>
    );
};

export {App};